{
    "summary": "This code calculates storage and download speeds for a project launching on another media, with formulas for zoom levels and preference for downloading maps online.",
    "details": [
        {
            "comment": "The code discusses a project that won't be launched on the current disk, instead precalculating total storage to run on another media. It also mentions manually configuring information from internet-map.net and downloading website images. The calculations include throttle technique estimates for download speeds and disk storage capacities for different resolutions.",
            "location": "\"/media/root/Prima/works/generated_docs/lazero_doc/src/bootstrap/legacy/concentration/old_toys/internet_maps/README\":0-22",
            "content": "this project is not going to be launched on this disk.\ninstead, the total storage will be precalculated, and therefore run on another media.\nmy disk resources are precious, and i do not want to make it ugly.\ninternet-map.net, unwilling to give out the source info, i have to manually configure the information.\nreally should i do so? maybe it is hidden inside some apis which i never know.\nIf my only purpose is to get the full list of all websites, then there should be no need to manually download all images.\nocr can be hard to perfrom. but once you've got the biggest picture avaliable, you can create some smaller images from that.\nbut it sounds stupid.\nif pure black, then that image will be abandoned.\nwill use throttle technique to do the best job.\navg_download_speed:100kb/s=6mb/min=0.36gb/hr=8.64gb/d\n    14:15000*15000*2kb=450000.0mb=450gb,52d\n    13:8000**2*2kb=128000.0mb=128gb,14.8d\n    >>skip 12\n    11:2000**2*2kb,0.95d\n    10:1000**2*2kb,0.2375d (QUESTIONABLE)\nscheme: (x,y)\n    (0,0)---------(1000,0)"
        },
        {
            "comment": "This code seems to be calculating a summation of a function s(f(k)) for zoom levels k ranging from 3 to 10. The formula s(t) is defined, and the function f(k) is given as t and double the previous value for different zoom levels. The author expresses frustration with math notations and would prefer downloading maps from the internet instead of synthesizing them locally.",
            "location": "\"/media/root/Prima/works/generated_docs/lazero_doc/src/bootstrap/legacy/concentration/old_toys/internet_maps/README\":23-47",
            "content": "        |               |\n        |               |\n    (0,1000)-----(1000,1000)\nformula:\n    for one zoom level k with t sequences in both dimentions, we have to scan:\n        s(t)=t**2+(t-1)**2+2+t*(t-1)\n    for different zoom levels, we have:\n        f(k)=t, f(k)=f(k-1)*2\n    we have k within [3,10], so to sum up them all:\n        sigma[k from 3 to 10]{s(f(k))}\nshould it be 1024.\nmath notations are like shits.\nyou can dynamically load them, as you wish.\nexamples:\n    https://d2h9tsxwphc7ip.cloudfront.net/14/7102%206010.png\n    https://d2h9tsxwphc7ip.cloudfront.net/0/0%200.png\nif i had a choice, i would choose to download it from internet, instead of local synth.\nspeed could be an issue, but i wouldn't prefer to get my phone burned.\nthis is meaningless. not using math, or using math, both need your participation. it is all about your personal choice."
        }
    ]
}